uhnp/src/DataProcessors/УстановкаСоответствияРегистров/УстановкаСоответствияРегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УстановкаСоответствияРегистров</name>
</mdclass:DataProcessor>

uhnp/src/Enums/СпособыИспользованияОперандов/СпособыИспользованияОперандов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыИспользованияОперандов</name>
  <enumValues>
    <name>ДляФормулРасчета</name>
  </enumValues>
  <enumValues>
    <name>ДляПримечаний</name>
  </enumValues>
  <enumValues>
    <name>ДляОбратногоРаспределения</name>
  </enumValues>
  <enumValues>
    <name>ДляКонтрольныхСоотношений</name>
  </enumValues>
  <enumValues>
    <name>ДляРучныхКорректировок</name>
  </enumValues>
  <enumValues>
    <name>ДляПараметрическихУсловий</name>
  </enumValues>
  <enumValues>
    <name>ДляАналитическихОтчетов</name>
  </enumValues>
  <enumValues>
    <name>ДляТрансформационныхКорректировок</name>
  </enumValues>
  <enumValues>
    <name>ДляЗаполненияОбъектовБД</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ДляСверкиВГО</name>
  </enumValues>
  <enumValues>
    <name>ДляОбменаДанными</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыВычисленияПараметровОперандов/СпособыВычисленияПараметровОперандов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВычисленияПараметровОперандов</name>
  <enumValues>
    <name>ПериодОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПериодОтчетаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаПериодаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаПериодаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаПериодаОтчетаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаПериодаОтчетаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаГода</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаГодаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаГода</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаГодаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>АналогичныйПериодПредыдущегоГода</name>
  </enumValues>
  <enumValues>
    <name>АналогичныйПериодГодаСоСдвигом</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>ВалютаОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПериметрОтчета</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияОтчета</name>
  </enumValues>
  <enumValues>
    <name>НеПериметрОтчета</name>
  </enumValues>
  <enumValues>
    <name>СценарийОтчета</name>
  </enumValues>
  <enumValues>
    <name>СценарийФакта</name>
  </enumValues>
  <enumValues>
    <name>Аналитика1</name>
  </enumValues>
  <enumValues>
    <name>Аналитика2</name>
  </enumValues>
  <enumValues>
    <name>Аналитика3</name>
  </enumValues>
  <enumValues>
    <name>Аналитика4</name>
  </enumValues>
  <enumValues>
    <name>Аналитика5</name>
  </enumValues>
  <enumValues>
    <name>Аналитика6</name>
  </enumValues>
  <enumValues>
    <name>ФункцияНаВстроенномЯзыкеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ФиксированноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
  <enumValues>
    <name>СписокФиксированныхЗначений</name>
  </enumValues>
  <enumValues>
    <name>СписокПоИерархии</name>
  </enumValues>
  <enumValues>
    <name>ОтборПоРеквизитамАналитики</name>
  </enumValues>
  <enumValues>
    <name>НеРавноФиксированномуЗначению</name>
  </enumValues>
  <enumValues>
    <name>НеВСпискеФиксированныхЗначений</name>
  </enumValues>
  <enumValues>
    <name>НеВСпискеПоИерархии</name>
  </enumValues>
  <enumValues>
    <name>ИнтервалПериодов</name>
  </enumValues>
  <enumValues>
    <name>ГруппаИ</name>
  </enumValues>
  <enumValues>
    <name>ГруппаИЛИ</name>
  </enumValues>
  <enumValues>
    <name>ГруппаНЕ</name>
  </enumValues>
  <enumValues>
    <name>Больше</name>
  </enumValues>
  <enumValues>
    <name>БольшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>Меньше</name>
  </enumValues>
  <enumValues>
    <name>МеньшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>ФункцияНаВстроенномЯзыкеСписокЗначений</name>
  </enumValues>
  <enumValues>
    <name>ПроектОтчета</name>
  </enumValues>
  <enumValues>
    <name>ПроектОтчетаИерархия</name>
  </enumValues>
  <enumValues>
    <name>ВышестоящийПериод</name>
  </enumValues>
  <enumValues>
    <name>ДатаНачалаВышестоящегоПериода</name>
  </enumValues>
  <enumValues>
    <name>ДатаКонцаВышестоящегоПериода</name>
  </enumValues>
  <enumValues>
    <name>ИсходныйДокумент</name>
  </enumValues>
  <enumValues>
    <name>ТипЗначения</name>
  </enumValues>
  <enumValues>
    <name>СписокТиповЗначений</name>
  </enumValues>
  <enumValues>
    <name>СохраненнаяНастройкаОтбора</name>
  </enumValues>
  <enumValues>
    <name>НеПериодОтчета</name>
  </enumValues>
  <enumValues>
    <name>ФункцияНаВстроенномЯзыкеЗначениеВладельца</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыПолученияОперандов/СпособыПолученияОперандов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПолученияОперандов</name>
  <enumValues>
    <name>ВнутренниеДанныеПоказательОтчета</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеПараметрическаяНастройка</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеПроизвольныйЗапрос</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеРегистрБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеРегистрНакопления</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеРегистрСведений</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеПараметрическаяНастройка</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеПроизвольныйЗапрос</name>
  </enumValues>
  <enumValues>
    <name>ФункцияНаВстроенномЯзыке</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеОстаткиИОборотыИзПланаСчетов</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеРегистр</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеРегистрНакопления</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеРегистрБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>ПроводкаТрансформационнойКорректировки</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеРегистрСведений</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеADO</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеГруппаРаскрытия</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеСправочники</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеСправочники</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеДанныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеДанныеРеквизитОбъектаБД</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыЗаполненияПолейИсточника/СпособыЗаполненияПолейИсточника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыЗаполненияПолейИсточника</name>
  <enumValues>
    <name>ПолеИсходнойТаблицы</name>
  </enumValues>
  <enumValues>
    <name>КонтекстОбъектаЗагрузки</name>
  </enumValues>
  <enumValues>
    <name>ФиксированноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>РучнойВвод</name>
  </enumValues>
  <enumValues>
    <name>ПолеДругогоИсточникаДанных</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ТипыБазДанных/ТипыБазДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыБазДанных</name>
  <predefined>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
    <items>
      <name>ОбменТаблДок</name>
      <description>Файлы Microsoft Excel</description>
    </items>
  </predefined>
  <attributes>
    <name>ВИБПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоУмолчанию</name>
    <comment>Если при сопоставлении получено пустое значение валюты, тогда подставить значение валюты по умолчанию</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменДаннымиРегламентнымЗаданием</name>
    <comment>Выполнять данными контроля НСИ регламентным заданием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьНСИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяПланыОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеВидовСубконто</name>
    <attributes>
      <name>ВидСубконтоИБ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/КлючиАналитикиУчетаПоПартнерам/КлючиАналитикиУчетаПоПартнерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиАналитикиУчетаПоПартнерам</name>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/КлючиАналитикиУчетаНоменклатуры/КлючиАналитикиУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиАналитикиУчетаНоменклатуры</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМестаХранения</name>
    <type>
      <types>EnumRef.ТипыМестХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяТерритория</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/РегистрыНакопленияБД/РегистрыНакопленияБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегистрыНакопленияБД</name>
  <comment>Содержит данные, необходимые для параметрической настройки выборки данных из регистров накопления текущей и внешних информационных баз</comment>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регистраторы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ресурсы</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Измерения</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/УстановкаСоответствияРегистров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбновитьОбъектыУчета() Экспорт
		
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ИсточникиДанныхДляРасчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетов КАК ИсточникиДанныхДляРасчетов
	|ГДЕ
	|	ИсточникиДанныхДляРасчетов.ОбъектУчета ССЫЛКА Перечисление.УдалитьОбъектыФинансовогоУчета
	|	И ИсточникиДанныхДляРасчетов.СпособИспользования = ЗНАЧЕНИЕ(Перечисление.СпособыИспользованияОперандов.ПроизвольныеДанные)";
	
	Результат=Запрос.Выполнить().Выбрать();
	
	СоответствиеОбъектовСтатьям = Перечисления.УдалитьОбъектыФинансовогоУчета.СоответствиеОбъектовФинансовогоУчетаСтатьямАктивовПассивов();
	ЗаменяемыеОбъектыУчета = Перечисления.УдалитьОбъектыФинансовогоУчета.ЗаменяемыеОбъектыФинансовогоУчета();
	
	Пока Результат.Следующий() Цикл
		
		ИсточникОбъект=Результат.Ссылка.ПолучитьОбъект(); 
		
		ЗаменяемыйОбъектУчета=ЗаменяемыеОбъектыУчета[ИсточникОбъект.ОбъектУчета];
		
		СтатьяАктивовПассивов = СоответствиеОбъектовСтатьям[?(ЗаменяемыйОбъектУчета=Неопределено,ИсточникОбъект.ОбъектУчета,ЗаменяемыйОбъектУчета)];
		
		Если НЕ СтатьяАктивовПассивов=Неопределено Тогда 
			
			ИсточникОбъект.ОбъектУчета=СтатьяАктивовПассивов;
			ИсточникОбъект.ОбменДанными.Загрузка=Истина;
			ИсточникОбъект.Записать(); 
			
		КонецЕсли;
	
	КонецЦикла;
				
КонецПроцедуры // ОбновитьОбъектыУчета() 

Функция ПолучитьТаблицуФинансовыхРегистров(НастройкиУчета=Неопределено) Экспорт
	
	НастройкиПроводок = Справочники.НастройкиФормированияПроводокМеждународногоУчета.НастройкиФормированияПроводок();
	НастройкиУчета = МеждународныйУчетПоДаннымФинансовыхРегистров.НастройкиУчетаПоНастройкамФормированияПроводок(
		НастройкиПроводок);

	ТаблицаОбъектовУчета=ПланыВидовХарактеристик.СтатьиАктивовПассивов.ОписаниеОбъектовФинансовогоУчета(НастройкиУчета);
    ТаблицаОбъектовУчета.Колонки.Добавить("ЕстьИсточник",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());	
	
	Возврат ТаблицаОбъектовУчета;
	
КонецФункции // ПолучитьТаблицуФинансовыхРегистров()

Функция ПолучитьДеревоОбъектовУчета(НастройкиУчета=Неопределено) Экспорт
	
	Если НастройкиУчета=Неопределено Тогда
		
		НастройкиПроводок = Справочники.НастройкиФормированияПроводокМеждународногоУчета.НастройкиФормированияПроводок();
		НастройкиУчета = МеждународныйУчетПоДаннымФинансовыхРегистров.НастройкиУчетаПоНастройкамФормированияПроводок(
			НастройкиПроводок);
			
	КонецЕсли;
		
	Возврат ПланыВидовХарактеристик.СтатьиАктивовПассивов.ДеревоОбъектовФинансовогоУчета(НастройкиУчета, Истина);	
			
КонецФункции // ДеревоОбъектовУчета() 
	
Процедура ЗаполнитьИсточникиДляФинансовыхРегистров(Параметры=Неопределено) Экспорт
	
	Перем НастройкиУчета;
		
	ВидыСубконтоДляПодбора=ПолучитьТаблицуСубконто();
	КэшВидовСубконто=Новый Соответствие;
	
	ОбновитьОбъектыУчета();
	
	#Область ОбъектыФинансовогоУчета
		
	ТаблицаОбъектовУчета=ПолучитьТаблицуФинансовыхРегистров(НастройкиУчета);
	ДеревоОбъектовУчета=ПолучитьДеревоОбъектовУчета(НастройкиУчета);
		
	Для Каждого СтрокаГруппа ИЗ ДеревоОбъектовУчета.Строки Цикл
		
		ГруппаИсточников=ПроверитьСоздатьГруппуИсточниковОбъектыУчета(СтрокаГруппа);
		
		Для Каждого СтрокаИсточник ИЗ СтрокаГруппа.Строки Цикл
			
			СтрокаОписание=ТаблицаОбъектовУчета.Найти(СтрокаИсточник.ОбъектУчета,"ОбъектУчета");
			
			ПроверитьСоздатьИсточникДанныхОбъектыУчета(ГруппаИсточников,СтрокаОписание,ВидыСубконтоДляПодбора,КэшВидовСубконто);
			
		КонецЦикла;
		
	КонецЦикла;
	
	МассивНеВДереве=ТаблицаОбъектовУчета.НайтиСтроки(Новый Структура("ЕстьИсточник",Ложь));
	
	ДанныеГруппы=Новый Структура;
	ДанныеГруппы.Вставить("Представление","Прочие объекты бухгалтерского учета");
	
	ГруппаИсточников=ПроверитьСоздатьГруппуИсточниковОбъектыУчета(ДанныеГруппы);
	
	Для Каждого СтрокаОписание ИЗ МассивНеВДереве Цикл
		
		ПроверитьСоздатьИсточникДанныхОбъектыУчета(ГруппаИсточников,СтрокаОписание,ВидыСубконтоДляПодбора,КэшВидовСубконто);	
		
	КонецЦикла;
	
	#КонецОбласти 
	#Область ХозяйственныеОперации 
	
	ДеревоХозОпераций=ПолучитьДеревоХозяйственныхОпераций();
	
	Для Каждого Строка ИЗ ДеревоХозОпераций.Строки Цикл
		
		Если Строка.ЭтоГруппа Тогда
			
			ГруппаОпераций=ПроверитьСоздатьГруппуИсточниковОперации(Строка);
			
			ЗаполнитьПоОперациямРекурсивно(ГруппаОпераций,Строка,ВидыСубконтоДляПодбора,КэшВидовСубконто);
			
		Иначе
			
			ПроверитьСоздатьИсточникДанныхОперации(Строка,ВидыСубконтоДляПодбора,КэшВидовСубконто);
			
		КонецЕсли;
		
	КонецЦикла;
		
	#КонецОбласти	
	
КонецПроцедуры // ЗаполнитьИсточникиДляФинансовыхРегистров() 

Функция ПолучитьТаблицуСубконто()
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	3 КАК Уровень,
	             |	МСФОВидыСубконто.ВидСубконто КАК ВидСубконто
	             |ПОМЕСТИТЬ ВидыСубконтоМСФО
	             |ИЗ
	             |	ПланСчетов.МСФО.ВидыСубконто КАК МСФОВидыСубконто
	             |ГДЕ
	             |	НЕ МСФОВидыСубконто.ВидСубконто.ПроизвольныйКласификаторУХ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВидыСубконтоКорпоративные.Ссылка КАК Ссылка,
	             |	ВидыСубконтоКорпоративные.ТипЗначения КАК ТипЗначения,
	             |	ЕСТЬNULL(ВидыСубконтоМСФО.Уровень, 0) + ВЫБОР
	             |		КОГДА ВидыСубконтоКорпоративные.Предопределенный
	             |			ТОГДА 1
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК СтепеньСоответствия
	             |ИЗ
	             |	ПланВидовХарактеристик.ВидыСубконтоКорпоративные КАК ВидыСубконтоКорпоративные
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоМСФО КАК ВидыСубконтоМСФО
	             |		ПО ВидыСубконтоКорпоративные.Ссылка = ВидыСубконтоМСФО.ВидСубконто
	             |ГДЕ
	             |	НЕ ВидыСубконтоКорпоративные.ПометкаУдаления
	             |	И НЕ ВидыСубконтоКорпоративные.ПроизвольныйКласификаторУХ
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	СтепеньСоответствия УБЫВ";
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции // ПолучитьТаблицуСубконто() 


Функция ПроверитьСоздатьГруппуИсточниковОбъектыУчета(СтрокаГруппа)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ИсточникиДанныхДляРасчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетов КАК ИсточникиДанныхДляРасчетов
	|ГДЕ
	|	ИсточникиДанныхДляРасчетов.ЭтоГруппа
	|	И ИсточникиДанныхДляРасчетов.Наименование = &Наименование
	|	И ИсточникиДанныхДляРасчетов.СпособИспользования = ЗНАЧЕНИЕ(Перечисление.СпособыИспользованияОперандов.ПроизвольныеДанные)
	|	И ИсточникиДанныхДляРасчетов.ТипБД = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ТекущаяИБ)";
	
	Запрос.УстановитьПараметр("Наименование",СтрокаГруппа.Представление);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Возврат Результат.Ссылка;
		
	Иначе
		
		СправочникОбъект=Справочники.ИсточникиДанныхДляРасчетов.СоздатьГруппу();
		СправочникОбъект.Наименование=СтрокаГруппа.Представление;
		СправочникОбъект.СпособИспользования=Перечисления.СпособыИспользованияОперандов.ПроизвольныеДанные;
		СправочникОбъект.ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ;
		СправочникОбъект.Записать();
		Возврат СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
КонецФункции // ПроверитьСоздатьГруппуИсточников()

Функция ВернутьДанныеОтбора(ЭлементОтбора)
	
	Если ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Больше Тогда
		
		Возврат Новый Структура("Отбор,УточнениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.Больше,ЭлементОтбора.ПравоеЗначение);
		
	ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
		
		Возврат Новый Структура("Отбор,УточнениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.БольшеИлиРавно,ЭлементОтбора.ПравоеЗначение); 
		
	ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.ВИерархии Тогда
		
		СписокОтбора=Новый СписокЗначений;
		СписокОтбора.Добавить(ЭлементОтбора.ПравоеЗначение);
		
		Возврат Новый Структура("Отбор,УточнениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.СписокПоИерархии,СписокОтбора);
		
	ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке Тогда
		
		Возврат Новый Структура("Отбор,УточнениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.СписокФиксированныхЗначений,ЭлементОтбора.ПравоеЗначение); 
		
	ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
		
		Возврат Новый Структура("Отбор,УточнениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.СписокПоИерархии,ЭлементОтбора.ПравоеЗначение); 
		
	ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Меньше Тогда
		
		Возврат Новый Структура("Отбор,УточнениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.Меньше,ЭлементОтбора.ПравоеЗначение); 
		
	ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
		
		Возврат Новый Структура("Отбор,УточнениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.МеньшеИлиРавно,ЭлементОтбора.ПравоеЗначение);
		
	ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
		
		СписокОтбора=Новый СписокЗначений;
		СписокОтбора.Добавить(ЭлементОтбора.ПравоеЗначение);
		
		Возврат Новый Структура("Отбор,УточнениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.НеВСпискеПоИерархии,СписокОтбора);
		
	ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСписке Тогда
		
		Возврат Новый Структура("Отбор,УточнениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.НеВСпискеФиксированныхЗначений,ЭлементОтбора.ПравоеЗначение);
		
	ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		
		Возврат Новый Структура("Отбор,УточнениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.НеВСпискеПоИерархии,ЭлементОтбора.ПравоеЗначение);
		
	ИначеЕсли ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно Тогда
		
		Возврат Новый Структура("Отбор,УточнениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.НеРавноФиксированномуЗначению,ЭлементОтбора.ПравоеЗначение);
		
	Иначе
		
		Возврат Новый Структура("Отбор,УточнениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.ФиксированноеЗначение,ЭлементОтбора.ПравоеЗначение);
		
	КонецЕсли;
	
	
КонецФункции // ВернутьСпособВычисленияПараметров() 

Функция ВернутьГруппуОтбораДанных(ГруппаЭлементовОтбора)
	
	Если ГруппаЭлементовОтбора.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ Тогда
		
		Возврат Новый Структура("Отбор,ПредставлениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.ГруппаИ,НСтр("ru = 'Группа И'"));
		
	ИначеЕсли ГруппаЭлементовОтбора.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли Тогда
		
		Возврат Новый Структура("Отбор,ПредставлениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.ГруппаИЛИ,НСтр("ru = 'Группа ИЛИ'"));
		
	Иначе
		
		Возврат Новый Структура("Отбор,ПредставлениеОтбора",Перечисления.СпособыВычисленияПараметровОперандов.ГруппаНЕ,НСтр("ru = 'Группа НЕ'"));		
		
	КонецЕсли;
			
КонецФункции // ВернутьГруппуОтбораДанных()

Процедура ДобавитьСтрокиОтбораДанныхРекурсивно(ЭлементыОтбора,СтрокаРодитель)
	
	Для Каждого Элемент ИЗ ЭлементыОтбора Цикл
		
		Если ТипЗнч(Элемент)=Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			ДанныеОтбора=ВернутьГруппуОтбораДанных(Элемент);
			
			ТекущаяСтрокаОтбора=СтрокаРодитель.Строки.Добавить();
			ТекущаяСтрокаОтбора.СпособВычисленияПараметра=ДанныеОтбора.Отбор;
			ТекущаяСтрокаОтбора.НаименованиеБД=ДанныеОтбора.ПредставлениеОтбора;
			
			ДобавитьСтрокиОтбораДанныхРекурсивно(Элемент.Элементы,ТекущаяСтрокаОтбора);
			
		Иначе
			
			ТекущаяСтрокаОтбора=СтрокаРодитель.Строки.Добавить();
			ТекущаяСтрокаОтбора.ПолеБД=Строка(Элемент.ЛевоеЗначение);
			ДанныеОтбора=ВернутьДанныеОтбора(Элемент);
			
			ТекущаяСтрокаОтбора.СпособВычисленияПараметра=ДанныеОтбора.Отбор;
			ТекущаяСтрокаОтбора.УточнениеСпособаОпределения=ДанныеОтбора.УточнениеОтбора;
			
		КонецЕсли;
	
	КонецЦикла;
		
КонецПроцедуры // ДобавитьСтрокиОтбораДанныхРекурсивно() 

Процедура ПреобразоватьОтборКомпоновкиДанныхВДеревоПараметров(ЭлементыОтбора,ДеревоПараметровОтбораБД)
		
	Для Каждого Элемент ИЗ ЭлементыОтбора Цикл
		
		Если ТипЗнч(Элемент)=Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			ДанныеОтбора=ВернутьГруппуОтбораДанных(Элемент);
			
			ТекущаяСтрокаОтбора=ДеревоПараметровОтбораБД.Строки.Добавить();
			ТекущаяСтрокаОтбора.СпособВычисленияПараметра=ДанныеОтбора.Отбор;
			ТекущаяСтрокаОтбора.НаименованиеБД=ДанныеОтбора.ПредставлениеОтбора;
			
			ДобавитьСтрокиОтбораДанныхРекурсивно(Элемент.Элементы,ТекущаяСтрокаОтбора);
			
		Иначе
			
			ТекущаяСтрокаОтбора=ДеревоПараметровОтбораБД.Строки.Добавить();
			ТекущаяСтрокаОтбора.ПолеБД=Строка(Элемент.ЛевоеЗначение);
			ДанныеОтбора=ВернутьДанныеОтбора(Элемент);
			
			ТекущаяСтрокаОтбора.СпособВычисленияПараметра=ДанныеОтбора.Отбор;
			ТекущаяСтрокаОтбора.УточнениеСпособаОпределения=ДанныеОтбора.УточнениеОтбора;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры // ПреобразоватьОтборКомпоновкиДанныхВДеревоПараметров() 

Процедура ПроверитьСоздатьИсточникДанныхОбъектыУчета(ГруппаИсточников,ОписаниеИсточника,ВидыСубконтоДляПодбора,КэшВидовСубконто)
	
	Если Не ЗначениеЗаполнено(ОписаниеИсточника.ИсточникДанных) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ИсточникиДанныхДляРасчетов.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.ИсточникиДанныхДляРасчетов КАК ИсточникиДанныхДляРасчетов
	             |ГДЕ
	             |	ИсточникиДанныхДляРасчетов.ОбъектУчета = &ОбъектУчета
	             |	И ИсточникиДанныхДляРасчетов.СпособПолучения = &СпособПолучения
	             |	И ИсточникиДанныхДляРасчетов.СпособИспользования = &СпособИспользования";
	
	Запрос.УстановитьПараметр("ОбъектУчета",ОписаниеИсточника.ОбъектУчета);
	Запрос.УстановитьПараметр("СпособПолучения",Перечисления.СпособыПолученияОперандов.ВнутренниеДанныеРегистрНакопления);
	Запрос.УстановитьПараметр("СпособИспользования",Перечисления.СпособыИспользованияОперандов.ПроизвольныеДанные);

	
	РегистрИсточник=ПолучитьОписаниеРегистраНакопленияБД(Справочники.ТипыБазДанных.ТекущаяИБ,ОписаниеИсточника.ИсточникДанных);
	
	Если Не ЗначениеЗаполнено(РегистрИсточник) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		ИсточникОбъект=Результат.Ссылка.ПолучитьОбъект();
		ИсточникОбъект.ПравилаИспользованияПолейЗапроса.Очистить();
		
		ИсточникОбъект.КэшВидовСубконто=КэшВидовСубконто;
		ИсточникОбъект.ВидыСубконтоДляПодбора=ВидыСубконтоДляПодбора;
		
		ИсточникОбъект.ПодготовитьТаблицыСопоставленийИОтборов();
		ИсточникОбъект.СоответствиеРесурсовДляТрансляции.Очистить();
		
		ИсточникОбъект.ПодготовитьТаблицыСопоставленийИОтборов();
		
		Если НЕ ИсточникОбъект.РегистрБД=РегистрИсточник Тогда
			
			ИсточникОбъект.РегистрБД=РегистрИсточник;
			ИсточникОбъект.ОсновнаяТаблицаРегистра=Истина;
			ИсточникОбъект.ОбъектИсточник=РегистрИсточник;
			ИсточникОбъект.ОбработатьПредзаполненныеРеквизиты();
			
		КонецЕсли;
			
	Иначе
		
		ИсточникОбъект=Справочники.ИсточникиДанныхДляРасчетов.СоздатьЭлемент();
		ИсточникОбъект.ОбъектУчета=ОписаниеИсточника.ОбъектУчета;
		ИсточникОбъект.ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ;
		ИсточникОбъект.СпособИспользования=Перечисления.СпособыИспользованияОперандов.ПроизвольныеДанные;
		ИсточникОбъект.СпособПолучения=Перечисления.СпособыПолученияОперандов.ВнутренниеДанныеРегистрНакопления;
		ИсточникОбъект.РегистрБД=РегистрИсточник;
		ИсточникОбъект.ОсновнаяТаблицаРегистра=Истина;
		
		ИсточникОбъект.КэшВидовСубконто=КэшВидовСубконто;
		ИсточникОбъект.ВидыСубконтоДляПодбора=ВидыСубконтоДляПодбора;
		
		ИсточникОбъект.ОбработатьПредзаполненныеРеквизиты();
		ИсточникОбъект.ТаблицаСоответствияБД.Очистить();

		ИсточникОбъект.Наименование=Строка(ОписаниеИсточника.ОбъектУчета);
		
	КонецЕсли;
	
	ИсточникОбъект.Родитель=ГруппаИсточников;
	ИсточникОбъект.ПодготовитьДеревоПараметровОтбораБД();
	
	ПараметрыОтражения=ПараметрыОтраженияДвиженийВФинансовомУчете(ОписаниеИсточника.ИсточникДанных);
			
	Если ТипЗнч(ОписаниеИсточника.ОтборДанных)=Тип("ОтборКомпоновкиДанных") Тогда
		
		ПреобразоватьОтборКомпоновкиДанныхВДеревоПараметров(ОписаниеИсточника.ОтборДанных.Элементы,ИсточникОбъект.ДеревоПараметровОтбораБД);
		
	КонецЕсли; 
	
	ЗаполнитьСоответствиеРесурсов(ИсточникОбъект,ОписаниеИсточника,ПараметрыОтражения);
	ЗаполнитьПоляАналитик(ИсточникОбъект,ОписаниеИсточника,ПараметрыОтражения);
	ИсточникОбъект.ПутьКДаннымОбъектНастройки=?(ПараметрыОтражения=Неопределено,ОписаниеИсточника.ПутьКДаннымОбъектНастройки,ПараметрыОтражения.ПутьКДаннымОбъектНастройки);
	
	ИсточникОбъект.мМодифицированность=Истина;
	ИсточникОбъект.Наименование=Строка(ИсточникОбъект.ОбъектУчета);
	ИсточникОбъект.СохранитьНастройкиОперанда();
	ИсточникОбъект.Записать(); 
	
	ОписаниеИсточника.ЕстьИсточник=Истина;
		
КонецПроцедуры // ПроверитьСоздатьИсточникДанных()

Процедура ЗаполнитьСоответствиеРесурсов(ИсточникОбъект,ОписаниеИсточника,ПараметрыОтражения)
	
	ИсточникОбъект.СоответствиеРесурсовДляТрансляции.Очистить();
	
	Если ПараметрыОтражения=Неопределено Тогда
		
		РесурсыРегл=ОписаниеИсточника.РесурсыРегл;
		РесурсыВал=ОписаниеИсточника.РесурсыВал;
		РесурсыКоличество=ОписаниеИсточника.РесурсыКоличество; 
		РесурсыУпр=ОписаниеИсточника.РесурсыУпр;
		
	Иначе
			
		РесурсыРегл=?(ОписаниеИсточника.РесурсыРегл.Количество()>0,ОписаниеИсточника.РесурсыРегл,ПараметрыОтражения.РесурсыРегл);
		РесурсыВал=?(ОписаниеИсточника.РесурсыВал.Количество()>0,ОписаниеИсточника.РесурсыВал,ПараметрыОтражения.РесурсыВал);
		РесурсыКоличество=?(ОписаниеИсточника.РесурсыКоличество.Количество()>0,ОписаниеИсточника.РесурсыКоличество,ПараметрыОтражения.РесурсыКоличество);
		РесурсыУпр=?(ОписаниеИсточника.РесурсыУпр.Количество()>0,ОписаниеИсточника.РесурсыУпр,ПараметрыОтражения.РесурсыУпр);
		
	КонецЕсли;	
	
	СоответствиеПоУмолчанию=Новый Соответствие;
	СоответствиеПоУмолчанию.Вставить("СуммаВВалютеУчета","СуммаРегл");
	СоответствиеПоУмолчанию.Вставить("СуммаВВалюте","Сумма");
	СоответствиеПоУмолчанию.Вставить("Количество","Количество");
	
		
	Если РесурсыРегл.Количество()=0 Тогда
		
		Если НЕ (ИсточникОбъект.РегистрБД.Ресурсы.Найти("СуммаРегл","Имя")=Неопределено
			И ИсточникОбъект.РегистрБД.Реквизиты.Найти("СуммаРегл","Имя")=Неопределено ) Тогда 
			
			НоваяСтрока=ИсточникОбъект.СоответствиеРесурсовДляТрансляции.Добавить();
			НоваяСтрока.РесурсИсточник="СуммаРегл";
			НоваяСтрока.РесурсПриемник="СуммаРегл";
			НоваяСтрока.Коэффициент=1; 
			
		КонецЕсли;
		
	Иначе
		
		Для Каждого Элемент ИЗ РесурсыРегл Цикл
			
			НоваяСтрока=ИсточникОбъект.СоответствиеРесурсовДляТрансляции.Добавить();
			
			Если ТипЗнч(Элемент)=Тип("СтрокаТаблицыЗначений") Тогда
				
				НоваяСтрока.РесурсИсточник=Элемент.ИмяРесурса;
				НоваяСтрока.РесурсПриемник="СуммаРегл";
				НоваяСтрока.Коэффициент=Элемент.Коэффициент;
				
			Иначе
				
				НоваяСтрока.РесурсИсточник=Элемент;
				НоваяСтрока.РесурсПриемник="СуммаРегл";
				НоваяСтрока.Коэффициент=?(Лев(Элемент,1)="-",-1,1);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Если РесурсыУпр.Количество()=0 Тогда
		
		Если НЕ (ИсточникОбъект.РегистрБД.Ресурсы.Найти("СуммаУпр","Имя")=Неопределено
			И ИсточникОбъект.РегистрБД.Реквизиты.Найти("СуммаУпр","Имя")=Неопределено ) Тогда 
			
			НоваяСтрока=ИсточникОбъект.СоответствиеРесурсовДляТрансляции.Добавить();
			НоваяСтрока.РесурсИсточник="СуммаУпр";
			НоваяСтрока.РесурсПриемник="СуммаУпр";
			НоваяСтрока.Коэффициент=1; 
			
		КонецЕсли;
		
	Иначе
		
		Для Каждого Элемент ИЗ РесурсыУпр Цикл
			
			НоваяСтрока=ИсточникОбъект.СоответствиеРесурсовДляТрансляции.Добавить();
			
			Если ТипЗнч(Элемент)=Тип("СтрокаТаблицыЗначений") Тогда
				
				НоваяСтрока.РесурсИсточник=Элемент.ИмяРесурса;
				НоваяСтрока.РесурсПриемник="СуммаУпр";
				НоваяСтрока.Коэффициент=Элемент.Коэффициент;
				
			Иначе
				
				НоваяСтрока.РесурсИсточник=Элемент;
				НоваяСтрока.РесурсПриемник="СуммаУпр";
				НоваяСтрока.Коэффициент=?(Лев(Элемент,1)="-",-1,1);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
	Если РесурсыВал.Количество()=0 Тогда
		
		Если НЕ (ИсточникОбъект.РегистрБД.Ресурсы.Найти("Сумма","Имя")=Неопределено
			И ИсточникОбъект.РегистрБД.Реквизиты.Найти("Сумма","Имя")=Неопределено) Тогда
			
			НоваяСтрока=ИсточникОбъект.СоответствиеРесурсовДляТрансляции.Добавить();
			НоваяСтрока.РесурсИсточник="Сумма";
			НоваяСтрока.РесурсПриемник="ВалютнаяСумма";
			НоваяСтрока.Коэффициент=1;
			
		КонецЕсли;
		
	Иначе
		
		Для Каждого Элемент ИЗ РесурсыВал Цикл
			
			НоваяСтрока=ИсточникОбъект.СоответствиеРесурсовДляТрансляции.Добавить();
			
			Если ТипЗнч(Элемент)=Тип("СтрокаТаблицыЗначений") Тогда
				
				НоваяСтрока.РесурсИсточник=Элемент.ИмяРесурса;
				НоваяСтрока.РесурсПриемник="ВалютнаяСумма";
				НоваяСтрока.Коэффициент=Элемент.Коэффициент;
				
			Иначе
				
				НоваяСтрока.РесурсИсточник=Элемент;
				НоваяСтрока.РесурсПриемник="ВалютнаяСумма";
				НоваяСтрока.Коэффициент=?(Лев(Элемент,1)="-",-1,1);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
	Если РесурсыКоличество.Количество()=0 Тогда
		
		Если НЕ (ИсточникОбъект.РегистрБД.Ресурсы.Найти("Количество","Имя")=Неопределено
			И ИсточникОбъект.РегистрБД.Реквизиты.Найти("Количество","Имя")=Неопределено) Тогда
	
		НоваяСтрока=ИсточникОбъект.СоответствиеРесурсовДляТрансляции.Добавить();
		НоваяСтрока.РесурсИсточник="Количество";
		НоваяСтрока.РесурсПриемник="Количество";
		НоваяСтрока.Коэффициент=1; 
		
		КонецЕсли;
		
	Иначе
		
		Для Каждого Элемент ИЗ РесурсыКоличество Цикл
			
			Если Элемент="0" Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			НоваяСтрока=ИсточникОбъект.СоответствиеРесурсовДляТрансляции.Добавить();
			
			Если ТипЗнч(Элемент)=Тип("СтрокаТаблицыЗначений") Тогда
				
				НоваяСтрока.РесурсИсточник=Элемент.ИмяРесурса;
				НоваяСтрока.РесурсПриемник="Количество";
				НоваяСтрока.Коэффициент=Элемент.Коэффициент;
				
			Иначе
				
				НоваяСтрока.РесурсИсточник=Элемент;
				НоваяСтрока.РесурсПриемник="Количество";
				НоваяСтрока.Коэффициент=?(Лев(Элемент,1)="-",-1,1);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
				
КонецПроцедуры // ЗаполнитьСоответствиеРесурсов() 

Процедура ЗаполнитьПоляАналитик(ИсточникОбъект,ОписаниеИсточника,ПараметрыОтражения)
		
	Если НЕ ПараметрыОтражения=Неопределено Тогда
		
		ЗаполнитьПоПараметрамОтражения(ИсточникОбъект,ПараметрыОтражения);
		
	КонецЕсли;
	
	ЗаполнитьПоКлючамИсточника(ИсточникОбъект);
	
КонецПроцедуры // ЗаполнитьПоляАналитик()

Процедура ЗаполнитьПоКлючамИсточника(ИсточникОбъект)
	
	Для Каждого СтрИзмерение ИЗ ИсточникОбъект.РегистрБД.Измерения Цикл 
		
		Если СтрИзмерение.ТипДанных="Справочник.КлючиАналитикиУчетаПоПартнерам" Тогда
			
			ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.ОрганизационныеЕдиницы,СтрИзмерение.Имя+".Организация");
			ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.СправочникКонтрагенты,СтрИзмерение.Имя+".Контрагент");
			ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.СправочникДоговораКонтрагентов,СтрИзмерение.Имя+".Договор");
            ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НаправленияДеятельности,СтрИзмерение.Имя+".НаправлениеДеятельности");
			
		ИначеЕсли СтрИзмерение.ТипДанных="Справочник.КлючиАналитикиУчетаНоменклатуры" Тогда 
			
			ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.СправочникНоменклатура,СтрИзмерение.Имя+".Номенклатура");
					
		КонецЕсли;
		
	КонецЦикла; 
	
	Для Каждого СтрРеквизит ИЗ ИсточникОбъект.РегистрБД.Реквизиты Цикл 
		
		Если СтрРеквизит.ТипДанных="Справочник.КлючиАналитикиУчетаПоПартнерам" Тогда
			
			ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.ОрганизационныеЕдиницы,СтрРеквизит.Имя+".Организация");
			ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.СправочникКонтрагенты,СтрРеквизит.Имя+".Контрагент");
			ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.СправочникДоговораКонтрагентов,СтрРеквизит.Имя+".Договор");
            ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НаправленияДеятельности,СтрРеквизит.Имя+".НаправлениеДеятельности");
			
		ИначеЕсли СтрИзмерение.ТипДанных="Справочник.КлючиАналитикиУчетаНоменклатуры" Тогда 
			
			ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.СправочникНоменклатура,СтрРеквизит.Имя+".Номенклатура");
					
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры // ЗаполнитьПоКлючамИсточника()

Процедура ЗаполнитьПоОписаниюИсточника(ИсточникОбъект,ОписаниеИсточника)
	
	
	
КонецПроцедуры // ЗаполнитьПоОписаниюИсточника() 

Процедура ЗаполнитьПоПараметрамОтражения(ИсточникОбъект,ПараметрыОтражения)
	
	Если ЗначениеЗаполнено(ПараметрыОтражения.ПутьКДаннымВалюта) Тогда
		
		ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.СправочникВалюты,ПараметрыОтражения.ПутьКДаннымВалюта);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОтражения.ПутьКДаннымНаправлениеДеятельности) Тогда
		
		ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.НаправленияДеятельности,ПараметрыОтражения.ПутьКДаннымНаправлениеДеятельности);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОтражения.ПутьКДаннымОрганизация) Тогда
		
		ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.ОрганизационныеЕдиницы,ПараметрыОтражения.ПутьКДаннымОрганизация);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОтражения.ПутьКДаннымПодразделение) Тогда
		
		ДобавитьСтрокуАналитики(ИсточникОбъект,ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Подразделения,ПараметрыОтражения.ПутьКДаннымПодразделение+".ЦФО");
		
	КонецЕсли;
	
	Для Каждого Элемент ИЗ ПараметрыОтражения.ИсточникиАналитики Цикл
		
		ТекВидСубконто=НайтиСоответствующийВидСубконтоКорпоративные(ИсточникОбъект,Элемент.Значение.Тип);
		
		Если НЕ ТекВидСубконто=Неопределено Тогда
						
			ДобавитьСтрокуАналитики(ИсточникОбъект,ТекВидСубконто,Элемент.Значение.ПутьКДанным);
			
		КонецЕсли;
		
	КонецЦикла;		
		
КонецПроцедуры // ЗаполнитьПоПараметрамОтражения()

Процедура ДобавитьСтрокуАналитики(ИсточникОбъект,ВидАналитики,ПутьКДанным)
	
	Если НЕ ИсточникОбъект.ТаблицаСоответствияБД.Найти(ПутьКДанным,"ПолеБД")=Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ИсточникОбъект.ТаблицаСоответствияБД.Найти(ВидАналитики,"ВидАналитики")=Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтрокаНастройки=ИсточникОбъект.ОпределитьРабочуюСтроку("ПолеБД",ПутьКДанным);
	
	ИсточникОбъект.ДобавитьСтрокуВозможныхПолей(ВидАналитики);
	СтрокаПоле=ИсточникОбъект.мТаблицаВозможныхПолей.Найти(ВидАналитики,"ВидАналитики");
	
	СтрокаТаблицы                       = ИсточникОбъект.ТаблицаСоответствияБД.Добавить();
	СтрокаТаблицы.АналитикаКонсолидации = СтрокаПоле.Поле;
	СтрокаТаблицы.ПсевдонимКонсолидации = ?(ЗначениеЗаполнено(СтрокаПоле.Синоним),СтрокаПоле.Синоним,СтрЗаменить(ПутьКДанным,".",""));
	СтрокаТаблицы.АналитикаОтчета		= СтрокаПоле.АналитикаОтчета;
	СтрокаТаблицы.ВидАналитики			= СтрокаПоле.ВидАналитики;
	СтрокаТаблицы.ТаблицаАналитики		= СтрокаПоле.ТаблицаАналитики;
	СтрокаТаблицы.Порядок				= СтрокаПоле.Порядок;	
	СтрокаТаблицы.СпособЗаполнения=Перечисления.СпособыЗаполненияПолейИсточника.ПолеИсходнойТаблицы;
	СтрокаТаблицы.ПолеБД=ПутьКДанным;
	СтрокаТаблицы.ПсевдонимБД=СтрЗаменить(СтрокаТаблицы.ПолеБД,".","");
	СтрокаТаблицы.Сопоставлено=Истина;
		
КонецПроцедуры // ДобавитьСтрокуАналитики() 
	
Функция ПолучитьОписаниеРегистраНакопленияБД(ТипБД,ИмяРегистра)	
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	РегистрыНакопленияБД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РегистрыНакопленияБД КАК РегистрыНакопленияБД
	|ГДЕ
	|	РегистрыНакопленияБД.Владелец = &Владелец
	|	И РегистрыНакопленияБД.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Владелец",ТипБД);
	Запрос.УстановитьПараметр("Наименование",ИмяРегистра);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Результат.Следующий();
	Возврат Результат.Ссылка;
	
КонецФункции // ПолучитьОписаниеРегистраНакопленияБД() 

Функция ПараметрыОтраженияДвиженийВФинансовомУчете(ИмяРегистра)
	
	Попытка
		
		Возврат РегистрыНакопления[ИмяРегистра].ПараметрыОтраженияДвиженийВФинансовомУчете();
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
		
КонецФункции // ПараметрыОтраженияДвиженийВФинансовомУчете() 

Функция НайтиСоответствующийВидСубконтоКорпоративные(ИсточникОбъект,ТипЗначения)
	
   Если ТипЗначения.Типы().Количество()>1 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
	ВидСубконтоСсылка= ИсточникОбъект.КэшВидовСубконто.Получить(ТипЗначения);
	
	Если НЕ ВидСубконтоСсылка=Неопределено Тогда
		
		Возврат ВидСубконтоСсылка;
		
	КонецЕсли;
		
	Для Индекс=0 ПО ИсточникОбъект.ВидыСубконтоДляПодбора.Количество()-1 Цикл
		
		ВидСубконтоСсылка=ИсточникОбъект.ВидыСубконтоДляПодбора[Индекс];
				
		Если ВидСубконтоСсылка.ТипЗначения.Типы().Количество()=1
			И ВидСубконтоСсылка.ТипЗначения.СодержитТип(ТипЗначения.Типы()[0]) Тогда
			
			ИсточникОбъект.КэшВидовСубконто.Вставить(ТипЗначения,ВидСубконтоСсылка.Ссылка);
			Возврат ВидСубконтоСсылка.Ссылка;
			
		КонецЕсли;
				
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // НайтиСоответствующийВидСубконтоКорпоративные() 

Функция ПроверитьСоздатьГруппуИсточниковОперации(СтрокаГруппа,Родитель=Неопределено)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ИсточникиДанныхДляРасчетов.Ссылка КАК Ссылка,
	             |	ИсточникиДанныхДляРасчетов.Родитель КАК Родитель,
	             |	ИсточникиДанныхДляРасчетов.Наименование КАК Наименование
	             |ИЗ
	             |	Справочник.ИсточникиДанныхДляРасчетов КАК ИсточникиДанныхДляРасчетов
	             |ГДЕ
	             |	ИсточникиДанныхДляРасчетов.ЭтоГруппа
	             |	И ИсточникиДанныхДляРасчетов.СпособИспользования = ЗНАЧЕНИЕ(Перечисление.СпособыИспользованияОперандов.ПроизвольныеДанные)
	             |	И ИсточникиДанныхДляРасчетов.ТипБД = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ТекущаяИБ)
	             |	И ИсточникиДанныхДляРасчетов.ХозяйственнаяОперация = &ХозяйственнаяОперация";
	
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",СтрокаГруппа.Ссылка);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	ТекНаименование=?(Родитель=Неопределено,СтрокаГруппа.Наименование+НСтр("ru = ' (хозяйственные операции)'",ОбщегоНазначения.КодОсновногоЯзыка()),СтрокаГруппа.Наименование);
	
	Если Результат.Следующий() Тогда
		
		Если Результат.Родитель=Родитель И Результат.Наименование=ТекНаименование Тогда
			
			Возврат Результат.Ссылка;
			
		Иначе
			
			ОбъектГруппа=Результат.Ссылка.ПолучитьОбъект();
						
			ОбъектГруппа.Наименование=ТекНаименование;
			ОбъектГруппа.Родитель=Родитель;
			
			ОбъектГруппа.ОбменДанными.Загрузка=Истина;
			ОбъектГруппа.Записать();
			
			Возврат Результат.Ссылка;
			
		КонецЕсли;	
		
	Иначе
		
		СправочникОбъект=Справочники.ИсточникиДанныхДляРасчетов.СоздатьГруппу();
		СправочникОбъект.Наименование=ТекНаименование;
		СправочникОбъект.Родитель=Родитель;
		СправочникОбъект.ХозяйственнаяОперация=СтрокаГруппа.Ссылка;
		СправочникОбъект.СпособИспользования=Перечисления.СпособыИспользованияОперандов.ПроизвольныеДанные;
		СправочникОбъект.ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ;
		СправочникОбъект.Записать();
		
		Возврат СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
КонецФункции // ПроверитьСоздатьГруппуИсточниковХозяйственныеОперации() 

Процедура ПроверитьСоздатьИсточникДанныхОперации(ОписаниеОперации,ВидыСубконтоДляПодбора,КэшВидовСубконто,Родитель=Неопределено)
	
	Если Не ЗначениеЗаполнено(ОписаниеОперации.ИсточникДанных) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РегистрИсточник=ПолучитьОписаниеРегистраНакопленияБД(Справочники.ТипыБазДанных.ТекущаяИБ,ОписаниеОперации.ИсточникДанных);
	
	Если Не ЗначениеЗаполнено(РегистрИсточник) Тогда
		
		Возврат;
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ОписаниеОперации.ИсточникСсылка) Тогда
		
		ИсточникОбъект=ОписаниеОперации.ИсточникСсылка.ПолучитьОбъект();
		ИсточникОбъект.ПравилаИспользованияПолейЗапроса.Очистить();
		
		ИсточникОбъект.КэшВидовСубконто=КэшВидовСубконто;
		ИсточникОбъект.ВидыСубконтоДляПодбора=ВидыСубконтоДляПодбора;
		
		ИсточникОбъект.ПодготовитьТаблицыСопоставленийИОтборов();
		ИсточникОбъект.СоответствиеРесурсовДляТрансляции.Очистить();
		
		Если НЕ ИсточникОбъект.РегистрБД=РегистрИсточник Тогда
			
			ИсточникОбъект.РегистрБД=РегистрИсточник;
			ИсточникОбъект.ОсновнаяТаблицаРегистра=Истина;
			ИсточникОбъект.ПриИзмененииРегистраБД();
			ИсточникОбъект.ОбъектИсточник=РегистрИсточник;
			
		КонецЕсли;
			
	Иначе
		
		ИсточникОбъект=Справочники.ИсточникиДанныхДляРасчетов.СоздатьЭлемент();
		ИсточникОбъект.ХозяйственнаяОперация=ОписаниеОперации.Ссылка;
		ИсточникОбъект.ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ;
		ИсточникОбъект.СпособИспользования=Перечисления.СпособыИспользованияОперандов.ПроизвольныеДанные;
		ИсточникОбъект.СпособПолучения=Перечисления.СпособыПолученияОперандов.ВнутренниеДанныеРегистрНакопления;
		ИсточникОбъект.РегистрБД=РегистрИсточник;
		ИсточникОбъект.ОсновнаяТаблицаРегистра=Истина;
		
		ИсточникОбъект.КэшВидовСубконто=КэшВидовСубконто;
		ИсточникОбъект.ВидыСубконтоДляПодбора=ВидыСубконтоДляПодбора;
		
		ИсточникОбъект.ОбработатьПредзаполненныеРеквизиты();
		ИсточникОбъект.ТаблицаСоответствияБД.Очистить();
		ИсточникОбъект.Наименование=ОписаниеОперации.Наименование;
		
	КонецЕсли;
		
	ИсточникОбъект.Родитель=Родитель;
	ИсточникОбъект.ПодготовитьДеревоПараметровОтбораБД(); 
	ЗаполнитьПоляАналитикОперации(ИсточникОбъект,ОписаниеОперации); 
	ЗаполнитьПоКлючамИсточника(ИсточникОбъект);
	
	СтрокаОтбора=ИсточникОбъект.ДеревоПараметровОтбораБД.Строки.Добавить();
	СтрокаОтбора.ПолеБД="ХозяйственнаяОперация";			
	СтрокаОтбора.СпособВычисленияПараметра=Перечисления.СпособыВычисленияПараметровОперандов.ФиксированноеЗначение;
	СтрокаОтбора.УточнениеСпособаОпределения=ОписаниеОперации.Ссылка;
		
	МетаданныеРегистра=Метаданные.РегистрыНакопления[ОписаниеОперации.ИсточникДанных];
	
	ДобавитьРесурсыРегистра(ИсточникОбъект,МетаданныеРегистра);
						
	ИсточникОбъект.мМодифицированность=Истина;
	ИсточникОбъект.Наименование=ОписаниеОперации.Наименование;
	ИсточникОбъект.СохранитьНастройкиОперанда();
	ИсточникОбъект.Записать(); 
			
КонецПроцедуры // ПроверитьСоздатьИсточникДанных()

Процедура ЗаполнитьПоляАналитикОперации(ИсточникОбъект,ОписаниеОперации)
		
	СхемаДанных=СхемаПолученияДанных(ОписаниеОперации.ИсточникДанных);
	
	Если СхемаДанных=Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстЗапроса=СхемаДанных.НаборыДанных[0].Запрос;
	
	ПостроительЗапроса= Новый ПостроительЗапроса;
	ПостроительЗапроса.Текст=ТекстЗапроса;
	
	ПостроительЗапроса.FillSettings();
	
	ПоляЗапроса=ПолучитьТаблицуПолей(ПостроительЗапроса.ПолучитьЗапрос().Текст);
	
	Для Каждого Поле ИЗ ПостроительЗапроса.SelectedFields Цикл
		
		ПолеЗапроса=ПостроительЗапроса.AvailableFields[Поле.Name]; 
		
		СтрПоле=ПоляЗапроса.Найти(ПолеЗапроса.Представление,"Представление");
		
		Если СтрПоле=Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
				
		ТекВидСубконто=НайтиСоответствующийВидСубконтоКорпоративные(ИсточникОбъект,ПолеЗапроса.ТипЗначения);
		
		Если НЕ ТекВидСубконто=Неопределено Тогда
						
			ДобавитьСтрокуАналитики(ИсточникОбъект,ТекВидСубконто,СтрПоле.Поле);
				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоляАналитик()     

Функция ПолучитьДеревоХозяйственныхОпераций()
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ИсточникиДанныхДляРасчетов.Ссылка КАК Ссылка,
	             |	ИсточникиДанныхДляРасчетов.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	             |ПОМЕСТИТЬ ИсточникиОперации
	             |ИЗ
	             |	Справочник.ИсточникиДанныхДляРасчетов КАК ИсточникиДанныхДляРасчетов
	             |ГДЕ
	             |	НЕ ИсточникиДанныхДляРасчетов.ХозяйственнаяОперация = &ПустаяОперация
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	НастройкиХозяйственныхОпераций.Ссылка КАК Ссылка,
	             |	НастройкиХозяйственныхОпераций.ЭтоГруппа КАК ЭтоГруппа,
	             |	НастройкиХозяйственныхОпераций.Наименование КАК Наименование,
	             |	НастройкиХозяйственныхОпераций.ИсточникДанных КАК ИсточникДанных,
	             |	НастройкиХозяйственныхОпераций.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	             |	ИсточникиОперации.Ссылка КАК ИсточникСсылка
	             |ИЗ
	             |	Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ИсточникиОперации КАК ИсточникиОперации
	             |		ПО НастройкиХозяйственныхОпераций.Ссылка = ИсточникиОперации.ХозяйственнаяОперация
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Наименование ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("ПустаяОперация",Справочники.НастройкиХозяйственныхОпераций.ПустаяСсылка());
	
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
		
КонецФункции // ПолучитьДеревоХозяйственныхОпераций() 

Процедура ЗаполнитьПоОперациямРекурсивно(Родитель,СтрокаРодитель,ВидыСубконтоДляПодбора,КэшВидовСубконто)
	
	Для Каждого Строка ИЗ СтрокаРодитель.Строки Цикл
		
		Если Строка.ЭтоГруппа Тогда
			
			ГруппаОпераций=ПроверитьСоздатьГруппуИсточниковОперации(Строка,Родитель);
			
			ЗаполнитьПоОперациямРекурсивно(ГруппаОпераций,Строка,ВидыСубконтоДляПодбора,КэшВидовСубконто);
			
		Иначе
			
			ПроверитьСоздатьИсточникДанныхОперации(Строка,ВидыСубконтоДляПодбора,КэшВидовСубконто,Родитель);
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры // ЗаполнитьПоОперациямРекурсивно()

Процедура ДобавитьРесурсыРегистра(ИсточникОбъект,МетаданныеРегистра)
	
	Для Каждого МетаданныеРесурс ИЗ МетаданныеРегистра.Ресурсы Цикл
		
		НоваяСтрока=ИсточникОбъект.СоответствиеРесурсовДляТрансляции.Добавить();
		НоваяСтрока.РесурсИсточник=МетаданныеРесурс.Имя;
		НоваяСтрока.ПредставлениеИсточник=МетаданныеРесурс.Синоним+?(ЗначениеЗаполнено(МетаданныеРесурс.Подсказка),": "+МетаданныеРесурс.Подсказка,"");
		НоваяСтрока.Коэффициент=1;
		
	КонецЦикла;
			
КонецПроцедуры // ДобавитьРесурсыРегистра() 

Функция СхемаПолученияДанных(ИсточникДанных) 

	СхемаПолученияДанных = Неопределено;
	
	МакетыИсточниковПолученияДанных = Метаданные.Справочники.НастройкиХозяйственныхОпераций.Макеты;
	МакетИсточникаПолученияДанных = МакетыИсточниковПолученияДанных.Найти(ИсточникДанных); // ОбъектМетаданныхМакет -
	Если МакетИсточникаПолученияДанных <> Неопределено Тогда
		ИмяСхемы = МакетИсточникаПолученияДанных.Имя; 
		СхемаПолученияДанных = Справочники.НастройкиХозяйственныхОпераций.ПолучитьМакет(ИмяСхемы);
	КонецЕсли;
	
	Возврат СхемаПолученияДанных;

КонецФункции

Функция ПолучитьТаблицуПолей(ТекстЗапроса)
	
	ДанныеЗапроса=ОбщегоНазначенияУХ.РазложитьСтрокуВМассивПодстрок(ТекстЗапроса,"ИЗ");
	
	ТекстПоля=СтрЗаменить(ДанныеЗапроса[0],Символы.ПС,"");
	ТекстИсточник=ДанныеЗапроса[1];
	
	ДанныеИсточника=ОбщегоНазначенияУХ.РазложитьСтрокуВМассивПодстрок(ТекстИсточник," КАК ");
	ПсевдонимИсточник=СокрЛП(ДанныеИсточника[1]);
		
	РабочийТекст=Сред(ТекстПоля,СтрНайти(ТекстПоля,ПсевдонимИсточник));
	МассивПолей=СтрРазделить(РабочийТекст,",",Ложь);
	
	ТаблицаПолей=Новый ТаблицаЗначений;
	ТаблицаПолей.Колонки.Добавить("Поле");
	ТаблицаПолей.Колонки.Добавить("Представление");
	
	Для Каждого Строка ИЗ МассивПолей Цикл
		
		МассивПолей=ОбщегоНазначенияУХ.РазложитьСтрокуВМассивПодстрок(Строка," КАК ");
		ПолеБД=СокрЛП(МассивПолей[0]);
		ПредставлениеБД=СокрЛП(МассивПолей[1]);
			
		Если  СтрНайти(ПолеБД,ПсевдонимИсточник)>1 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		МассивПолей=ОбщегоНазначенияУХ.РазложитьСтрокуВМассивПодстрок(Строка," КАК ");
		
		СтрокаПоле=ТаблицаПолей.Добавить();
		СтрокаПоле.Поле=СтрЗаменить(ПолеБД,ПсевдонимИсточник+".","");
		СтрокаПоле.Представление=ПредставлениеБД;
		
	КонецЦикла;
		
	Возврат ТаблицаПолей; 
		
КонецФункции // ПолучитьТаблицуПолей()

#КонецЕсли
